# Kap5: Pandas
S.127

Inhalt:
- test

# 5.1: pandas-Datenstrukturen
values + index
- Series
- DataFrames

In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

### 5.1.1 - Series

In [2]:
obj = pd.Series([4,7,-5,3])
obj
obj.values
obj.index

0    4
1    7
2   -5
3    3
dtype: int64

array([ 4,  7, -5,  3], dtype=int64)

RangeIndex(start=0, stop=4, step=1)

In [3]:
obj2 = pd.Series([2,5,-1,-8], index=['d','b','a','c'])
obj2
obj2.index

d    2
b    5
a   -1
c   -8
dtype: int64

Index(['d', 'b', 'a', 'c'], dtype='object')

In [4]:
np.exp(obj2)     # Zusammenhang mit Indizes bleibt erhalten!

obj2['b']        # Zugriff mittels Index

'b' in obj2

d      7.389056
b    148.413159
a      0.367879
c      0.000335
dtype: float64

5

True

**dict --> series**
- pd.Series()

In [5]:
# Series aus dict erstellen
sdata = {'Ohio':35000, 'Texas':71000,'Oregon':16000, 'Utah':5000}
sdata
obj3 = pd.Series(sdata)
obj3

# index selber Ã¼bergeben
print()
print('obj4:')
obj4 = pd.Series(sdata, index=['Califaronia', 'Utah', 'Ohio'])
obj4

# 
obj3 + obj4

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

obj4:

Califaronia        NaN
Utah            5000.0
Ohio           35000.0
dtype: float64

Califaronia        NaN
Ohio           70000.0
Oregon             NaN
Texas              NaN
Utah           10000.0
dtype: float64

**fehlende Daten finden**
- pd.isnull()

In [6]:
pd.isnull(obj4)

Califaronia     True
Utah           False
Ohio           False
dtype: bool

**Index & Name**

In [7]:
obj4.name = 'Population'
obj4.index.name = 'states'
obj4

states
Califaronia        NaN
Utah            5000.0
Ohio           35000.0
Name: Population, dtype: float64

### 5.1.2 - DataFrames
- Erstellen
- Spalten / Zeilen aufrufen
- Zuweisungen

**Erstellen**

In [8]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
       'year':[2000,2001,2002,2000,2001,2002],
       'pop':['1.5','1,7','3.6','2.4','2.9','3.1']}
df1 = pd.DataFrame(data)
df1.head(2)

df2 = pd.DataFrame(data, columns=['year','state','pop'])
df2

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1,7

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1,7
2  2002    Ohio  3.6
3  2000  Nevada  2.4
4  2001  Nevada  2.9
5  2002  Nevada  3.1

**Spalten / Zeilen aufrufen**

In [9]:
# Spalten aufrufen
df1.head(4)
df1['state']  # dict style
df1.state  # Series style

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1,7
2    Ohio  2002  3.6
3  Nevada  2000  2.4

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [10]:
# Zeilen aufrufen
df1.loc[4]

state    Nevada
year       2001
pop         2.9
Name: 4, dtype: object

**Erstellen und LÃ¶schen von Spalten**

In [11]:
# Erstellen
df2['dept'] = np.arange(6.0)
val = pd.Series([-1.3,4.3,2.3], index=[2,4,5])
df2['test'] = val

print()
print(df2)

   year   state  pop  dept  test
0  2000    Ohio  1.5   0.0   NaN
1  2001    Ohio  1,7   1.0   NaN
2  2002    Ohio  3.6   2.0  -1.3
3  2000  Nevada  2.4   3.0   NaN
4  2001  Nevada  2.9   4.0   4.3
5  2002  Nevada  3.1   5.0   2.3

In [12]:
del df2['test']
df2.head(2)

   year state  pop  dept
0  2000  Ohio  1.5   0.0
1  2001  Ohio  1,7   1.0

### 5.1.3 - Indexobjekt

In [13]:
df2.index
df2.columns
'pop' in df2.columns
2003 in df2.index

RangeIndex(start=0, stop=6, step=1)

Index(['year', 'state', 'pop', 'dept'], dtype='object')

True

False

# 5.2: Funktionalitaet

Interaktion von Daten in Series oder DataFrames.

### 5.2.1 - Neuindizierung

In [14]:
# using reindex
df2
df2.reindex(np.arange(5,-1,-1)).head(3)
df2.reindex([4,0,1]).head(3)

   year   state  pop  dept
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1,7   1.0
2  2002    Ohio  3.6   2.0
3  2000  Nevada  2.4   3.0
4  2001  Nevada  2.9   4.0
5  2002  Nevada  3.1   5.0

   year   state  pop  dept
5  2002  Nevada  3.1   5.0
4  2001  Nevada  2.9   4.0
3  2000  Nevada  2.4   3.0

   year   state  pop  dept
4  2001  Nevada  2.9   4.0
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1,7   1.0

In [15]:
# creating new dataframe
pd.DataFrame(df2, columns = ['anus', 'dept','state'], index = range(9))

   anus  dept   state
0   NaN   0.0    Ohio
1   NaN   1.0    Ohio
2   NaN   2.0    Ohio
3   NaN   3.0  Nevada
4   NaN   4.0  Nevada
5   NaN   5.0  Nevada
6   NaN   NaN     NaN
7   NaN   NaN     NaN
8   NaN   NaN     NaN

In [16]:
# using 'loc' for reindexing index AND columns
# df2.loc[[2,3,4,7,0], ['penis', 'state']]
df2.loc[[2,3,4,7,0], ['penis', 'state']]

C:\Users\Dura\AppData\Local\Programs\Python\Python37-32\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   penis   state
2    NaN    Ohio
3    NaN  Nevada
4    NaN  Nevada
7    NaN     NaN
0    NaN    Ohio

### 5.2.2 - Achsen lÃ¶schen

In [17]:
# raw data:
ser = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])
ser
dat = pd.DataFrame(np.arange(16).reshape(4,4), index = ['Ohio', 'Colorado', 'Utah', 'NewYork'],
                 columns = ['one', 'two', 'three', 'four'])
dat

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [18]:
# drop rows from series
ser.drop(['c','e'])

# drop rows from dataframe
dat.drop(['Ohio','Utah'], axis = 0) 
dat.drop(['three'],axis = 1)

a    0.0
b    1.0
d    3.0
dtype: float64

          one  two  three  four
Colorado    4    5      6     7
NewYork    12   13     14    15

          one  two  four
Ohio        0    1     3
Colorado    4    5     7
Utah        8    9    11
NewYork    12   13    15

### 5.2.3 - Indizierung und Auswahl

In [21]:
dat

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [19]:
dat.loc['Colorado', ['two','one']]
dat.loc[['Colorado', 'Utah'], ['two','one']]

two    5
one    4
Name: Colorado, dtype: int32

          two  one
Colorado    5    4
Utah        9    8

          two  one
Colorado    5    4
Utah        9    8

**Integer Indizes**

In [32]:
ser = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser

a    0.0
b    1.0
c    2.0
dtype: float64

In [36]:
ser[-3]

0.0

**Arithmetische Methoden und FÃ¼llwerte**

In [41]:
df1 = pd.DataFrame(np.arange(12.0).reshape((3,4)), columns = list('abcd'))
df1.loc[1,'b'] = np.nan
df2 = pd.DataFrame(np.arange(20.0).reshape((4,5)), columns = list('abcde'))
display(df1)
display(df2)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  NaN   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [45]:
# arithmetic addition - NaN if not overlappingabs
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [46]:
# 'fill_value' argument
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   6.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [48]:
# rdiv function = 1 / ...
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250       NaN  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

## Broadcasting

operation between series and dataframes

In [69]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]  # same as frame.loc['Utah']
display(frame)
display(series)

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [70]:
# Index of Series - mapped to - Columns of DataFrame
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [71]:
# no overlapping --> new indexing
series2 = pd.Series(range(3), index = ['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [72]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [79]:
# Broadcasting over columns
series3 = frame['d']
display(series3)
display(frame)

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [80]:
frame - series3

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [81]:
frame.sub(series3, axis = 'index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## Apply

In [87]:
# works with numpy ufuncs!
np.abs(frame)

# apply - function
f = lambda x: x.max() - x.min()
display(frame.max())
display(frame)
display(frame.apply(f))

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

b     9.0
d    10.0
e    11.0
dtype: float64

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

b    9.0
d    9.0
e    9.0
dtype: float64

In [95]:
# function with more return values

def g(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])

frame.apply(g)

       b     d     e
min  0.0   1.0   2.0
max  9.0  10.0  11.0

## Sort

In [100]:
# Sort Series
obj = pd.Series(range(4), index = ['b', 'a', 'd', 'c'])
display(obj)
display(obj.sort_index())

b    0
a    1
d    2
c    3
dtype: int64

a    1
b    0
c    3
d    2
dtype: int64

In [110]:
# Sort DataFrame
frame = pd.DataFrame(np.arange(20).reshape((4,5)), index = ['three', 'one', 'four', 'two'], 
                    columns = ['c', 'a', 'd', 'b', 'e'])
display(frame)
display(frame.sort_index())
print()
print('axis = 1: ')
display(frame.sort_index(axis = 1))
print()
print('axis = 1: ')

        c   a   d   b   e
three   0   1   2   3   4
one     5   6   7   8   9
four   10  11  12  13  14
two    15  16  17  18  19

        c   a   d   b   e
four   10  11  12  13  14
one     5   6   7   8   9
three   0   1   2   3   4
two    15  16  17  18  19

axis = 1

        a   b   c   d   e
three   1   3   0   2   4
one     6   8   5   7   9
four   11  13  10  12  14
two    16  18  15  17  19

## Rank

In [112]:
# Rank
df = pd.DataFrame(data={'Animal': ['cat', 'penguin', 'dog', 'spider', 'snake'], 
                        'Number_legs': [4, 2, 4, 8, np.nan]})
df

    Animal  Number_legs
0      cat          4.0
1  penguin          2.0
2      dog          4.0
3   spider          8.0
4    snake          NaN

In [119]:
df['default_rank'] = df['Number_legs'].rank()  # default 
df['max_rank'] = df['Number_legs'].rank(method='max')  # same values using highest rank
df['NA_bottom'] = df['Number_legs'].rank(na_option='bottom')  # NaN are last
df['pct_rank'] = df['Number_legs'].rank(pct=True)  # percentage ranking

df

    Animal  Number_legs  default_rank  max_rank  NA_bottom  pct_rank
0      cat          4.0           2.5       3.0        2.5     0.625
1  penguin          2.0           1.0       1.0        1.0     0.250
2      dog          4.0           2.5       3.0        2.5     0.625
3   spider          8.0           4.0       4.0        4.0     1.000
4    snake          NaN           NaN       NaN        5.0       NaN

# 5.3: STATISTICS